projects.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://vlnn.dev/rss.xml"
      title="RSS feed for https://vlnn.dev/">
<title>Projects</title>
<meta name="author" content="Volodymyr Anokhin">
<meta name="referrer" content="no-referrer">
<link href= "static/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<link rel="apple-touch-icon-precomposed" href="static/favicon-152.png">
<link rel="msapplication-TitleImage" href="static/favicon-144.png">
<link rel="msapplication-TitleColor" href="#0141ff">
<link rel="stylesheet" href="static/katex.min.css">
<meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status"><div class="h1">
  <a href="https://vlnn.dev">Generalistic stuff VLNN writes</a>
  <div class="sitelinks">
    <a href="https://github.com/vlnn">Github</a> | <a href="https://vlnn.dev/projects.html">Projects</a> | <a href="https://www.linkedin.com/in/volodymyr-anokhin/">Linkedin</a>
  </div>
</div></div>
<div id="content">
<div class="post-date">09 Oct 2022</div><h1 class="post-title"><a href="https://vlnn.dev/projects.html">Projects</a></h1>
<div id="outline-container-org154beff" class="outline-2">
<h2 id="org154beff">Current projects:</h2>
<div class="outline-text-2" id="text-org154beff">
</div>
<div id="outline-container-orgbd4b76a" class="outline-3">
<h3 id="orgbd4b76a">Tech-blog <a href="https://vlnn.dev/blog">VLNN writes</a></h3>
</div>
<div id="outline-container-org8e24b6e" class="outline-3">
<h3 id="org8e24b6e">Kinesis Advantage customized layout</h3>
<div class="outline-text-3" id="text-org8e24b6e">
<p>
I&rsquo;ve tried to create a layout which is symmetrical and home-row driven. You may find it <a href="https://github.com/vlnn/kinesis-advantage-2">here</a>.
The project is mostly done for now, as I have no interest to support official firmware anymore, and QMK-stuff has been unchanged for months. Still, I plan to create MacOS version in future. Still it&rsquo;s being supported.
</p>
</div>
</div>
<div id="outline-container-org1a7d4d0" class="outline-3">
<h3 id="org1a7d4d0">Zesty</h3>
<div class="outline-text-3" id="text-org1a7d4d0">
<p>
<b>VERY EARLY DEVELOPMENT STAGE</b> I&rsquo;m playing around with Clojure&rsquo;s ways of code generation, thus there&rsquo;s simple Z80 assembler written in Clojure.
</p>
</div>
</div>
</div>

<div id="outline-container-org88a7d2a" class="outline-2">
<h2 id="org88a7d2a">Cancelled or frozen projects</h2>
<div class="outline-text-2" id="text-org88a7d2a">
</div>
<div id="outline-container-orgf1db5fc" class="outline-3">
<h3 id="orgf1db5fc">TODO</h3>
</div>
</div>
<div class="taglist"><a href="https://vlnn.dev/tags.html">Tags</a>: <a href="https://vlnn.dev/tag-project.html">project</a> </div>
<div id="comments"></div></div>
<div id="postamble" class="status"><div id="archive">
  <a href="https://vlnn.dev/archive.html">Other posts may be not available</a>
</div> </div>
</body>
</html>
